{
  "backend/main.mo": "Main Motoko actor implementing the rankings backend with player management, user profiles, and admin-controlled category switching across 10 game categories including the renamed `spearMace` and `diamondSmpNethopSpear`.",
  "backend/migration.mo": "Migration module that defines old and new ranking data types (renaming `ltms`→`spearMace` and `pot`→`diamondSmpNethopSpear`) and provides a `run` function to migrate actor state.",
  "feature_evidence.json": "Feature evidence report documenting two completed rename features: 'LTMs'→'Spear Mace' and 'Pot'→'Diamond SMP Nethop Spear' across multiple frontend files, with associated test IDs and affected components.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their roles and noting the category key renames from `ltms`/`pot` to `spearMace`/`diamondSmpNethopSpear`.",
  "frontend/index.css": "Global CSS file setting up Tailwind base styles and defining OKLCH-based CSS custom properties for light and dark theme color tokens including backgrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point titled 'Muti Tiers' that mounts the React app into a `#root` div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that simply renders `RankingsPage` as the sole view.",
  "frontend/src/components/AddPlayerModal.tsx": "Modal dialog for adding a new player with form fields for username, UUID, region, points, title, and per-category tier badges; game mode labels reflect the updated `spearMace` and `diamondSmpNethopSpear` keys.",
  "frontend/src/components/AdminControls.tsx": "Admin controls component with Add Player and Remove Player buttons that gate actions behind a passcode modal and manage unlock state internally, opening `AddPlayerModal` directly after authentication.",
  "frontend/src/components/CategoryTabs.tsx": "Renders a horizontal scrollable tab bar with SVG icons for each game category (Overall, Spear Mace, Vanilla, UHC, etc.), highlighting the active category and calling a callback on tab change.",
  "frontend/src/components/PasscodeModal.tsx": "A dialog modal that prompts for an admin passcode, validates it against a hardcoded value, and calls onSuccess or shows an error accordingly.",
  "frontend/src/components/PlayerRow.tsx": "Renders a single player row in the rankings table, displaying rank position (with gold/silver/bronze styling), Minecraft avatar, username, points, region badge, and tier badges.",
  "frontend/src/components/RankingsTable.tsx": "Displays a filterable rankings table with a header row, skeleton loading state, and a list of PlayerRow components; shows an empty state when no players match the search query.",
  "frontend/src/components/SearchInput.tsx": "A controlled search input component with a search icon, clear button, and keyboard shortcut hint for filtering players by username.",
  "frontend/src/components/TierBadge.tsx": "Renders a small colored pill badge showing a player's tier (e.g. HT1, LT3) for a given game category, using category-specific background/border colors and tier-specific text colors.",
  "frontend/src/data/mockData.ts": "Defines the CategoryKey type and exports empty mock data structures (mockPlayerData array and MOCK_DATA record) for all ranking categories.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access control if a token is present, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an `InternetIdentityProvider` component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating player ranking data from the backend actor, including raw rankings, player search, all players list, and adding a player.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS layers, defines OKLCH-based CSS custom properties for a forced-dark Minecraft-inspired theme, and adds utility classes for pixelated rendering and rank gradients.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrapping the root `App` component.",
  "frontend/src/pages/RankingsPage.tsx": "Main rankings page component that displays a filterable, categorized leaderboard of players with a navigation bar, category tabs, search input, and admin controls.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a Minecraft-inspired color palette, pixel and sans font families, custom shadows, border radii, and animation keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state (version 11) for 'Muti Tiers', a Minecraft PvP rankings app. Documents features, architectural notes, admin passcode protection, and player management requirements."
}