{
  "backend/main.mo": "Main Motoko actor implementing the rankings backend with player records, ranking categories, user profiles, and access-controlled admin operations (add/remove players, switch categories).",
  "backend/migration.mo": "Migration module that transforms the old actor state (separate diamondSmp/spear arrays and a players Map) into the new unified playerRecords array format.",
  "feature_evidence.json": "Feature evidence report linking two implemented features—useRemovePlayer mutation hook and the Remove Player admin flow—to their relevant files and test IDs.",
  "frontend-file-summaries.txt": "JSON map of short summaries for each frontend source file, describing the purpose and notable changes of every component, hook, and page.",
  "frontend/index.css": "Tailwind base CSS with OKLCH CSS custom property tokens for both light and dark themes used by shadcn/ui components.",
  "frontend/index.html": "Minimal HTML entry point titled 'Muti Tiers' that mounts the React app via the /src/main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that simply renders RankingsPage as the sole view.",
  "frontend/src/components/AddPlayerModal.tsx": "Modal dialog for adding a new player with fields for username, UUID, region, points, title, and per-category tier badges; submits via the useAddPlayer mutation hook.",
  "frontend/src/components/AdminControls.tsx": "Admin toolbar with Add Player and Remove Player buttons; uses sessionStorage to track passcode unlock state and renders a player-selection dialog that calls useRemovePlayer to delete the chosen player.",
  "frontend/src/components/CategoryTabs.tsx": "Renders a tab bar for switching between game categories (Overall, Vanilla, UHC, etc.), each with a custom inline SVG icon. Accepts the active category and a change handler as props.",
  "frontend/src/components/PasscodeModal.tsx": "A dialog modal that prompts for an admin passcode and calls onSuccess or onClose based on whether the hardcoded passcode matches the input.",
  "frontend/src/components/PlayerRow.tsx": "Displays a single player's ranking row including rank position (with gold/silver/bronze styling), Crafatar avatar, username, points, region badge, and tier badges.",
  "frontend/src/components/RankingsTable.tsx": "Renders a filterable rankings table with a header row, loading skeleton state, and a list of PlayerRow components; shows an empty state when no players match the search query.",
  "frontend/src/components/SearchInput.tsx": "A controlled text input with a search icon and a clear button for filtering players by username.",
  "frontend/src/components/TierBadge.tsx": "Renders a small colored pill badge showing a player's tier (e.g. HT1, LT3) for a given game category, using per-category background/border colors and per-tier text colors.",
  "frontend/src/data/mockData.ts": "Defines the CategoryKey union type and exports empty mock data structures (mockPlayerData array and MOCK_DATA record) for all ranking categories.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (anonymous or authenticated via Internet Identity), initializes admin access control when a token is present, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login, logout, and identity persistence via AuthClient with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating player ranking data (by category, search, or all players) via the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines a Minecraft-inspired dark theme using CSS custom properties and utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/RankingsPage.tsx": "Main rankings page component that displays a filterable, categorized leaderboard table with a search input, category tabs, admin controls, and a footer.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a Minecraft-inspired color palette, custom fonts, animations, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Tracks the project state (version 21) for 'Muti Tiers', a Minecraft PvP rankings app, including architectural notes, known issues (admin passcode persistence, backend auth guard, remove player), and a list of existing features."
}