{
  "backend/main.mo": "Main Motoko actor implementing the rankings backend with player CRUD operations, category switching, user profiles, and role-based access control via MixinAuthorization.",
  "backend/migration.mo": "Defines the migration module for the backend actor state; currently a no-op that returns the old state unchanged.",
  "feature_evidence.json": "Feature evidence report linking two audited features (Add Player and Remove Player end-to-end flows) to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to one-line summaries describing each file's role in the application.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Muti Tiers' that mounts the React app via a root div and module script.",
  "frontend/src/App.tsx": "Root React component that renders RankingsPage as the sole view.",
  "frontend/src/components/AddPlayerModal.tsx": "Modal form for adding a new player with fields for username, UUID, region, points, title, category, and per-mode tier badges; submits via the useAddPlayer mutation and closes on success.",
  "frontend/src/components/AdminControls.tsx": "Admin UI component with Add Player and Remove Player buttons gated behind a passcode modal; uses sessionStorage to persist the unlocked state and delegates mutations to useAddPlayer/useRemovePlayer hooks.",
  "frontend/src/components/CategoryTabs.tsx": "Renders a tab bar for switching between game categories (Overall, Vanilla, UHC, etc.), each with a custom SVG icon. Accepts the active category and a change handler as props.",
  "frontend/src/components/PasscodeModal.tsx": "A dialog modal that prompts for an admin passcode and calls onSuccess or onClose based on whether the hardcoded passcode matches the input.",
  "frontend/src/components/PlayerRow.tsx": "Displays a single player's ranking row including rank position (with gold/silver/bronze styling), avatar, username, points, region badge, and tier badges.",
  "frontend/src/components/RankingsTable.tsx": "Renders a filterable rankings table with a header row, loading skeleton state, and a list of PlayerRow components; shows an empty state when no players match the search query.",
  "frontend/src/components/SearchInput.tsx": "A controlled search input with a search icon, clear button, and keyboard shortcut hint, used for filtering players by username.",
  "frontend/src/components/TierBadge.tsx": "Renders a small colored badge pill displaying a player's tier (e.g. HT1, LT3) for a given game category, using per-category background/border colors and per-tier text colors.",
  "frontend/src/data/mockData.ts": "Defines the CategoryKey union type and exports empty mock data structures (mockPlayerData array and MOCK_DATA record) for all game categories.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (anonymous or authenticated via Internet Identity), initializing admin access control when an admin token is present, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login/logout state and persisting identity via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating player ranking data (by category, search, add, remove) via the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines a Minecraft-inspired dark theme using CSS custom properties and utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/RankingsPage.tsx": "Main rankings page component that displays a category-tabbed leaderboard with search, admin controls, and a sorted player rankings table.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with a Minecraft-inspired color palette, custom fonts, animations, and OKLCH-based CSS variable color tokens.",
  "project_state.json": "Tracks the project state (version 25) for 'Muti Tiers', a Minecraft PvP rankings app, including architectural notes, known issues (admin passcode persistence, add/remove player bugs), and a list of existing features."
}