{
  "kind": "build_request",
  "title": "Fix Remove Player functionality",
  "projectName": "Muti Tiers",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Add a `removePlayer` update method to the backend Motoko actor in backend/main.mo that accepts a player UUID (Text) and removes the matching player record from all category stable storage arrays. The method must not perform any caller identity or admin authorization check — it must accept and process any valid call.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove player is not working"
        ]
      },
      "acceptanceCriteria": [
        "A `removePlayer(uuid: Text)` update method exists in backend/main.mo",
        "The method removes the player with the matching UUID from every category stable array (overall, spearMace, vanilla, uhc, diamondSmp, nethop, smp, sword, axe, mace, spear)",
        "No authorization or caller identity check blocks the call",
        "Calling removePlayer with a UUID that does not exist is a no-op and does not throw an error"
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add a `useRemovePlayer` mutation hook in frontend/src/hooks/useQueries.ts that calls the backend `removePlayer` method with the selected player's UUID and invalidates the relevant React Query cache keys on success.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove player is not working"
        ]
      },
      "acceptanceCriteria": [
        "A `useRemovePlayer` hook is exported from useQueries.ts",
        "The hook calls the backend actor's `removePlayer` method with the target player UUID",
        "On success, the query cache for all category rankings is invalidated so the table re-fetches and reflects the removal"
      ]
    },
    {
      "id": "REQ-23",
      "text": "Fix the Remove Player flow in frontend/src/components/AdminControls.tsx so that: (1) when the Remove Player button is clicked and the session is unlocked (passcode already entered this session via sessionStorage), the user is prompted to select or confirm which player to remove without re-showing the PasscodeModal; (2) if the session is not yet unlocked, the PasscodeModal is shown first; (3) once confirmed, the `useRemovePlayer` mutation is called with the target player's UUID and the player disappears from the rankings table immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove player is not working"
        ]
      },
      "acceptanceCriteria": [
        "Clicking Remove Player when already unlocked does not re-prompt the PasscodeModal",
        "Clicking Remove Player when not yet unlocked shows the PasscodeModal first, then proceeds after correct passcode entry",
        "The selected player is removed from the rankings table after the mutation completes",
        "The unlocked state is read from sessionStorage (key consistent with AdminControls existing implementation) so it persists across re-renders within the same session"
      ]
    }
  ],
  "constraints": [
    "Do not add any backend-level caller identity or admin authorization checks to removePlayer",
    "Passcode gate (65515616151) must remain exclusively on the frontend in AdminControls.tsx and PasscodeModal.tsx",
    "Do not modify any file listed in frontend.immutablePaths"
  ],
  "nonGoals": [
    "Changing the Add Player flow or PasscodeModal logic",
    "Modifying category tab labels or keys",
    "Any UI redesign beyond the Remove Player interaction"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}