{
  "kind": "coverage_report",
  "version": "1.0",
  "generatedAt": "2026-02-25T23:57:00.787Z",
  "sources": {
    "buildRequest": true,
    "implementationPlan": true
  },
  "requirements": {
    "total": 4,
    "implemented": 2,
    "items": [
      {
        "id": "REQ-27",
        "summary": "In AddPlayerModal.tsx, make every per-category tier badge input field optional and clearable: each of the 11 tier fields (Overall, Spear Mace, Vanilla, UHC, Diamond SMP, NethOP, SMP, Sword, Axe, Mace, Spear) must accept an empty string as valid input, and the form must submit successfully even when one or more tier fields are left blank or cleared. Do not require all tier fields to be filled.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/components/AddPlayerModal.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-28",
        "summary": "Update the backend addPlayer method in backend/main.mo to treat tier badge entries with empty labels as absent — skip storing any tier badge record where the tier label is an empty string or whitespace. This ensures partial tier badge submissions from the frontend are stored correctly without empty badge artifacts.",
        "status": "unknown",
        "plannedFiles": [],
        "matchedFiles": []
      },
      {
        "id": "REQ-29",
        "summary": "Perform a thorough end-to-end audit and fix of the Add Player flow: (1) Confirm the backend addPlayer method in backend/main.mo has no admin authorization guard and accepts any valid call unconditionally. (2) Confirm useAddPlayer in useQueries.ts constructs the correct argument shape (including only non-empty tier badges) and calls the backend actor method. (3) Confirm AddPlayerModal.tsx serialises the form state into the exact shape the backend expects and closes the modal on success. (4) Confirm React Query cache is invalidated for all relevant category keys after a successful add so the rankings table refreshes immediately.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/hooks/useQueries.ts",
          "frontend/src/components/AddPlayerModal.tsx",
          "frontend/src/pages/RankingsPage.tsx"
        ],
        "matchedFiles": [
          "frontend/src/hooks/useQueries.ts",
          "frontend/src/pages/RankingsPage.tsx"
        ]
      },
      {
        "id": "REQ-30",
        "summary": "Perform a thorough end-to-end audit and fix of the Remove Player flow: (1) Confirm the backend removePlayer method in backend/main.mo removes the player matching the given UUID from all category stable storage arrays without any authorization check. (2) Confirm useRemovePlayer in useQueries.ts calls the backend removePlayer method with the correct UUID argument and invalidates all relevant React Query cache keys on success. (3) Confirm AdminControls.tsx: when session is already unlocked (sessionStorage flag set), the Remove Player button immediately shows a player-selection/confirmation step without re-prompting the PasscodeModal; if not unlocked, shows PasscodeModal first. (4) After confirmation, the player disappears from the rankings table immediately.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/components/AdminControls.tsx",
          "frontend/src/hooks/useQueries.ts"
        ],
        "matchedFiles": [
          "frontend/src/hooks/useQueries.ts"
        ]
      }
    ]
  },
  "changedFiles": [
    "backend/main.mo",
    "backend/migration.mo",
    "build-request.json",
    "feature_evidence.json",
    "frontend-file-summaries.txt",
    "frontend-implementation-plan.json",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/RankingsPage.tsx",
    "project_state.json",
    "scratch/component-selection.json",
    "spec.md",
    "spec_vs_diff_report.json"
  ]
}